In [1]:
import pandas as pd

In [5]:
drinks = pd.read_csv('https://bit.ly/drinksbycountry', index_col='country')
#Videos email header = Get up-to-speed with recent changes in Python pandas
#This particular vid: https://www.youtube.com/watch?v=te5JrSCW-LY&list=PL5-da3qGB5ICCsgW1MxlZ0Hq8LL5U3u9y&index=33

In [10]:
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

## ix

In [7]:
drinks.loc['Angola','spirit_servings']
#loc accesses by label
#Note that this returned an error, Angola isn't an index, until I set index_col='country'

57

In [8]:
drinks.iloc[4,1]
#iloc(integer location) accesses by position

57

In [12]:
#drinks.ix['Angola',1]
#this is deprecated in 22

### So, what do we do?

In [13]:
drinks.loc['Angola',drinks.columns[1]]

57

In [14]:
drinks.iloc[drinks.index.get_loc('Angola'),1]

57

In [15]:
drinks.loc[drinks.index[4],'spirit_servings']

57

In [16]:
drinks.iloc[4,drinks.columns.get_loc('spirit_servings')]

57

In [18]:
x=drinks.loc['Angola', ]

In [19]:
type(x)

pandas.core.series.Series

In [20]:
x

beer_servings                      217
spirit_servings                     57
wine_servings                       45
total_litres_of_pure_alcohol       5.9
continent                       Africa
Name: Angola, dtype: object

In [23]:
y=drinks.iloc[:,1]

In [24]:
type(y)

pandas.core.series.Series

# Aliases have been added for isnull notnull

In [25]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [26]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [28]:
ufo.isnull().head()

    City  Colors Reported  Shape Reported  State   Time
0  False             True           False  False  False
1  False             True           False  False  False
2  False             True           False  False  False
3  False             True           False  False  False
4  False             True           False  False  False

In [29]:
ufo.notnull().head()

   City  Colors Reported  Shape Reported  State  Time
0  True            False            True   True  True
1  True            False            True   True  True
2  True            False            True   True  True
3  True            False            True   True  True
4  True            False            True   True  True